Res-container-setEven-randomFront-v6/container_t_10_c_30_frontCore_4_wrkCore_2/wrk.txt
Running 1m test @ http://128.226.119.92:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 4915.510ms, rate sampling interval: 17891ms
  Thread calibration: mean lat.: 4998.907ms, rate sampling interval: 18022ms
  Thread calibration: mean lat.: 4922.944ms, rate sampling interval: 17989ms
  Thread calibration: mean lat.: 5012.883ms, rate sampling interval: 18022ms
  Thread calibration: mean lat.: 5001.967ms, rate sampling interval: 18186ms
  Thread calibration: mean lat.: 4916.583ms, rate sampling interval: 17858ms
  Thread calibration: mean lat.: 4967.401ms, rate sampling interval: 17973ms
  Thread calibration: mean lat.: 4893.410ms, rate sampling interval: 17940ms
  Thread calibration: mean lat.: 4742.037ms, rate sampling interval: 17498ms
  Thread calibration: mean lat.: 4995.904ms, rate sampling interval: 18169ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    34.53s    13.96s    0.98m    58.12%
    Req/Sec   166.75      3.40   172.00     80.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.73s 
 75.000%   46.33s 
 90.000%    0.90m 
 99.000%    0.98m 
 99.900%    0.99m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9437.183     0.000000            1         1.00
   15081.471     0.100000         8381         1.11
   20152.319     0.200000        16781         1.25
   25018.367     0.300000        25157         1.43
   30048.255     0.400000        33510         1.67
   34734.079     0.500000        41918         2.00
   37060.607     0.550000        46113         2.22
   39124.991     0.600000        50287         2.50
   41353.215     0.650000        54451         2.86
   43712.511     0.700000        58701         3.33
   46333.951     0.750000        62850         4.00
   47677.439     0.775000        64924         4.44
   49020.927     0.800000        67062         5.00
   50298.879     0.825000        69134         5.71
   51478.527     0.850000        71238         6.67
   52592.639     0.875000        73301         8.00
   53215.231     0.887500        74360         8.89
   53837.823     0.900000        75404        10.00
   54493.183     0.912500        76434        11.43
   55148.543     0.925000        77491        13.33
   55771.135     0.937500        78531        16.00
   56098.815     0.943750        79081        17.78
   56459.263     0.950000        79591        20.00
   56786.943     0.956250        80117        22.86
   57147.391     0.962500        80618        26.67
   57573.375     0.968750        81168        32.00
   57769.983     0.971875        81415        35.56
   57966.591     0.975000        81674        40.00
   58163.199     0.978125        81945        45.71
   58359.807     0.981250        82198        53.33
   58589.183     0.984375        82489        64.00
   58687.487     0.985938        82603        71.11
   58785.791     0.987500        82726        80.00
   58884.095     0.989062        82840        91.43
   59047.935     0.990625        82992       106.67
   59179.007     0.992188        83172       128.00
   59179.007     0.992969        83172       142.22
   59277.311     0.993750        83287       160.00
   59310.079     0.994531        83321       182.86
   59375.615     0.995313        83428       213.33
   59408.383     0.996094        83464       256.00
   59408.383     0.996484        83464       284.44
   59473.919     0.996875        83550       320.00
   59473.919     0.997266        83550       365.71
   59506.687     0.997656        83590       426.67
   59539.455     0.998047        83604       512.00
   59572.223     0.998242        83658       568.89
   59572.223     0.998437        83658       640.00
   59572.223     0.998633        83658       731.43
   59572.223     0.998828        83658       853.33
   59604.991     0.999023        83683      1024.00
   59604.991     0.999121        83683      1137.78
   59637.759     0.999219        83693      1280.00
   59670.527     0.999316        83734      1462.86
   59670.527     0.999414        83734      1706.67
   59670.527     0.999512        83734      2048.00
   59670.527     0.999561        83734      2275.56
   59670.527     0.999609        83734      2560.00
   59670.527     0.999658        83734      2925.71
   59670.527     0.999707        83734      3413.33
   59703.295     0.999756        83745      4096.00
   59703.295     0.999780        83745      4551.11
   59703.295     0.999805        83745      5120.00
   59703.295     0.999829        83745      5851.43
   59703.295     0.999854        83745      6826.67
   59768.831     0.999878        83755      8192.00
   59768.831     0.999890        83755      9102.22
   59768.831     0.999902        83755     10240.00
   59768.831     0.999915        83755     11702.86
   59768.831     0.999927        83755     13653.33
   59768.831     0.999939        83755     16384.00
   59768.831     0.999945        83755     18204.44
   59768.831     0.999951        83755     20480.00
   59768.831     0.999957        83755     23405.71
   59768.831     0.999963        83755     27306.67
   59768.831     0.999969        83755     32768.00
   59768.831     0.999973        83755     36408.89
   59768.831     0.999976        83755     40960.00
   59768.831     0.999979        83755     46811.43
   59768.831     0.999982        83755     54613.33
   59768.831     0.999985        83755     65536.00
   59768.831     0.999986        83755     72817.78
   59768.831     0.999988        83755     81920.00
   59801.599     0.999989        83756     93622.86
   59801.599     1.000000        83756          inf
#[Mean    =    34529.145, StdDeviation   =    13962.289]
#[Max     =    59768.832, Total count    =        83756]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  99554 requests in 1.00m, 41.04MB read
  Socket errors: connect 0, read 0, write 0, timeout 72
Requests/sec:   1658.21
Transfer/sec:    700.02KB